libsong/KLHvsNv/HvsNv/Source/ETH/user_stm32f4x7_eth.c
  /*---------------------- DMA Configuration   -------------------------------*/
  
  /* Drops frames with with TCP/IP checksum errors */
  ETH_InitStruct->ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Disable; 
  /* Store and forward mode enabled for receive */
  ETH_InitStruct->ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
  /* Flush received frame that created FIFO overflow */
  ETH_InitStruct->ETH_FlushReceivedFrame = ETH_FlushReceivedFrame_Enable;
  /* Store and forward mode enabled for transmit */
  ETH_InitStruct->ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;  
  /* Threshold TXFIFO level set to 64 bytes (used when threshold mode is enabled) */
  ETH_InitStruct->ETH_TransmitThresholdControl = ETH_TransmitThresholdControl_64Bytes;
  /* Disable forwarding frames with errors (short frames, CRC,...)*/
  ETH_InitStruct->ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
  /* Disable undersized good frames */
  ETH_InitStruct->ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
  /* Threshold RXFIFO level set to 64 bytes (used when Cut through mode is enabled) */
  ETH_InitStruct->ETH_ReceiveThresholdControl = ETH_ReceiveThresholdControl_64Bytes;
  /* Disable Operate on second frame (transmit a second frame to FIFO without 
  waiting status of previous frame*/
  ETH_InitStruct->ETH_SecondFrameOperate = ETH_SecondFrameOperate_Disable;
  /* DMA works on 32-bit aligned start source and destinations addresses */
  ETH_InitStruct->ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
  /* Enabled Fixed Burst Mode (mix of INC4, INC8, INC16 and SINGLE DMA transactions */
  ETH_InitStruct->ETH_FixedBurst = ETH_FixedBurst_Enable;
  /* DMA transfer max burst length = 32 beats = 32 x 32bits */
  ETH_InitStruct->ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
  ETH_InitStruct->ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
  /* DMA Ring mode skip length = 0 */
  ETH_InitStruct->ETH_DescriptorSkipLength = 0x0; 
  /* Equal priority (round-robin) between transmit and receive DMA engines */
  ETH_InitStruct->ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_1_1;
}

static U32 WritePHYRegister(U16 PHY_AbsoluteAddr,U16 PHY_Data)
{
	return(ETH_WritePHYRegister((PHY_AbsoluteAddr >> 5)&0x1f,PHY_AbsoluteAddr&0x1f,PHY_Data));
}

static U16 ReadPHYRegister(U16 PHY_AbsoluteAddr)
{
	return(ETH_ReadPHYRegister((PHY_AbsoluteAddr >> 5)&0x1f,PHY_AbsoluteAddr&0x1f));
}

extern U32 UserInitPHY(ETH_InitTypeDef* ETH_InitStruct)
{
	U16 PortStatus;
	U16 Port2MAC_Ctrl;
	U16 PortRegister;
	U8 ConnectPort = 0;
	const U8 CONNECT_PORT_0 = 1;
	const U8 CONNECT_PORT_1 = 2;
	U32 TimeOut;
	
	WritePHYRegister(PHY_P0_BASIC_MODE_CTRL,PHY_Reset);
	WritePHYRegister(PHY_P1_BASIC_MODE_CTRL,PHY_Reset);
//	//os_dly_wait(1);
	
	//检测PHY PORT0 复位是否完成
	TimeOut = 0;
	do
	{
		TimeOut++;
		//os_dly_wait(1);
		if(TimeOut >= 0xFFFF)
		{
			break;
		}
	}while (ReadPHYRegister(PHY_P0_BASIC_MODE_CTRL) & PHY_Reset);
	
	//检测PHY PORT1 复位是否完成
	TimeOut = 0;
	do
	{
		TimeOut++;
		//os_dly_wait(1);
	if(TimeOut >= 0xFFFF)
	{
		break;
	}
	}while (ReadPHYRegister(PHY_P1_BASIC_MODE_CTRL) & PHY_Reset);
	
	//Switch复位
	WritePHYRegister(SWH_SWITCH_RESET,3);
	TimeOut = 0;
	do
	{
		TimeOut++;
	//os_dly_wait(1);
	if(TimeOut >= 0xFFFF)
	{
		break;
	}
	}while (ReadPHYRegister(SWH_SWITCH_RESET) & 0x0003);
	
	//检测PORT0链路是否建立
	TimeOut = 0;
	do
	{
		TimeOut++;
	//os_dly_wait(1);
	if(TimeOut >= 0xFFFF)
	{
		break;
	}
	}while (!(ReadPHYRegister(PHY_P0_BASIC_MODE_STATUS) & PHY_Linked_Status));
	//Port 0已建立连接
	if(TimeOut < 0xFFFF)
	{
		ConnectPort |= CONNECT_PORT_0;
	}
	//检测PORT1链路是否建立
	TimeOut = 0;
	do
	{
		TimeOut++;
		//os_dly_wait(1);
		if(TimeOut >= 0xFFFF)
		{
			break;
		}
	}while (!(ReadPHYRegister(PHY_P1_BASIC_MODE_STATUS) & PHY_Linked_Status));
	//Port1已建立连接
	if(TimeOut < 0xFFFF)
	{
		ConnectPort |= CONNECT_PORT_1;
	}
	
	//禁止地址学习，不然IN和OUT的两根网线互换，会出现需要无法通信现象
	PortRegister = ReadPHYRegister(SWH_P0_BASIC_CTRL1);
	PortRegister |= 0x7000;
	WritePHYRegister(SWH_P0_BASIC_CTRL1,PortRegister);
		
	PortRegister = ReadPHYRegister(SWH_P1_BASIC_CTRL1);
	PortRegister |= 0x7000;
	WritePHYRegister(SWH_P1_BASIC_CTRL1,PortRegister);
		
	PortRegister = ReadPHYRegister(SWH_P2_BASIC_CTRL1);
	PortRegister |= 0x7000;
	WritePHYRegister(SWH_P2_BASIC_CTRL1,PortRegister);
		
	Port2MAC_Ctrl = ReadPHYRegister(SWH_P2_MAC_CTRL);
	
	//利用port0进行自适应设置
	if(ConnectPort & CONNECT_PORT_0)
	{
		//使能PORT0自适应
		WritePHYRegister(PHY_P0_BASIC_MODE_CTRL,PHY_AutoNegotiation);
		//等待PORT0自适应完成
		TimeOut = 0;
		do
		{
			TimeOut++;
			//os_dly_wait(1);
			if(TimeOut >= 0xFFFF)
			{
				break;
			}
		}while (!(ReadPHYRegister(PHY_P0_BASIC_MODE_STATUS) & PHY_AutoNego_Complete));
		//自适应成功，没有超时
		if(TimeOut < 0xFFFF)
		{
			PortStatus = ReadPHYRegister(SWH_P0_STATUS);
			if(PortStatus & SWH_FULL_DUPLEX)
			{
				ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;
				//Port2 即RMII设为全双工模式
				Port2MAC_Ctrl &= 0xfffd;				
			}
			else
			{
				ETH_InitStruct->ETH_Mode = ETH_Mode_HalfDuplex;
				//Port2 即RMII设为半双工模式
				Port2MAC_Ctrl |= 0x02;
			}
			if(PortStatus & SWH_100MBPS)
			{
				//Port2 即RMII设为100M bps
				ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
				Port2MAC_Ctrl &= 0xfffe;		
			}
			else
			{
				ETH_InitStruct->ETH_Speed = ETH_Speed_10M;
				//Port2 即RMII设为10M bps
				Port2MAC_Ctrl |= 0x0001;
			}
			WritePHYRegister(SWH_P2_MAC_CTRL,Port2MAC_Ctrl);
			WritePHYRegister(PHY_P1_BASIC_MODE_CTRL,PHY_FULLDUPLEX_100M);
			return(ETH_SUCCESS);			
		}
	}
	//利用port1进行自适应设置
	else if(ConnectPort & CONNECT_PORT_1)
	{
		//使能PORT1自适应
		WritePHYRegister(PHY_P1_BASIC_MODE_CTRL,PHY_AutoNegotiation);
		//等待PORT1自适应完成
		TimeOut = 0;
		do
		{
			TimeOut++;
			//os_dly_wait(1);
			if(TimeOut >= 0xFFFF)
			{
				break;
			}
		}while (!(ReadPHYRegister(PHY_P1_BASIC_MODE_STATUS) & PHY_AutoNego_Complete));
		//自适应成功，没有超时
		if(TimeOut < 0xFFFF)
		{
			PortStatus = ReadPHYRegister(SWH_P1_STATUS);
			if(PortStatus & SWH_FULL_DUPLEX)
			{
				ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;
				Port2MAC_Ctrl &= 0xfffd;				
			}
			else
			{
				ETH_InitStruct->ETH_Mode = ETH_Mode_HalfDuplex;
				Port2MAC_Ctrl |= 0x02;
			}
			if(PortStatus & SWH_100MBPS)
			{
				ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
				Port2MAC_Ctrl &= 0xfffe;
			}
			else
			{
				ETH_InitStruct->ETH_Speed = ETH_Speed_10M;
				Port2MAC_Ctrl |= 0x0001;
			}
			WritePHYRegister(SWH_P2_MAC_CTRL,Port2MAC_Ctrl);
			WritePHYRegister(PHY_P0_BASIC_MODE_CTRL,PHY_FULLDUPLEX_100M);
			return(ETH_SUCCESS);	
		}
	}
	
	//port0和port1都没有建立连接，或者自适应超时，则设置为100M全双工	
	WritePHYRegister(PHY_P0_BASIC_MODE_CTRL,PHY_FULLDUPLEX_100M);
	WritePHYRegister(PHY_P1_BASIC_MODE_CTRL,PHY_FULLDUPLEX_100M);
	ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;
	Port2MAC_Ctrl &= 0xfffd;	
	ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
	Port2MAC_Ctrl &= 0xfffe;
	WritePHYRegister(SWH_P2_MAC_CTRL,Port2MAC_Ctrl);	
	return(ETH_SUCCESS);
}

/**
  * @brief  Initializes the ETHERNET peripheral according to the specified
  *   parameters in the ETH_InitStruct .
  * @param ETH_InitStruct: pointer to a ETH_InitTypeDef structure that contains
  *   the configuration information for the specified ETHERNET peripheral.
  * @param PHYAddress: external PHY address
  * @retval ETH_ERROR: Ethernet initialization failed
  *         ETH_SUCCESS: Ethernet successfully initialized
  */
uint32_t ETH_Init(ETH_InitTypeDef* ETH_InitStruct, uint16_t PHYAddress)
{
	  uint32_t RegValue = 0, tmpreg = 0;
  __IO uint32_t i = 0;
  RCC_ClocksTypeDef  rcc_clocks;
  uint32_t hclk = 60000000;
  __IO uint32_t timeout = 0;
  /* Check the parameters */
  /* MAC --------------------------*/ 
  assert_param(IS_ETH_AUTONEGOTIATION(ETH_InitStruct->ETH_AutoNegotiation));
  assert_param(IS_ETH_WATCHDOG(ETH_InitStruct->ETH_Watchdog));
  assert_param(IS_ETH_JABBER(ETH_InitStruct->ETH_Jabber));
  assert_param(IS_ETH_INTER_FRAME_GAP(ETH_InitStruct->ETH_InterFrameGap));
  assert_param(IS_ETH_CARRIER_SENSE(ETH_InitStruct->ETH_CarrierSense));
  assert_param(IS_ETH_SPEED(ETH_InitStruct->ETH_Speed));
  assert_param(IS_ETH_RECEIVE_OWN(ETH_InitStruct->ETH_ReceiveOwn));
  assert_param(IS_ETH_LOOPBACK_MODE(ETH_InitStruct->ETH_LoopbackMode));
  assert_param(IS_ETH_DUPLEX_MODE(ETH_InitStruct->ETH_Mode));
  assert_param(IS_ETH_CHECKSUM_OFFLOAD(ETH_InitStruct->ETH_ChecksumOffload));
  assert_param(IS_ETH_RETRY_TRANSMISSION(ETH_InitStruct->ETH_RetryTransmission));
  assert_param(IS_ETH_AUTOMATIC_PADCRC_STRIP(ETH_InitStruct->ETH_AutomaticPadCRCStrip));
  assert_param(IS_ETH_BACKOFF_LIMIT(ETH_InitStruct->ETH_BackOffLimit));
  assert_param(IS_ETH_DEFERRAL_CHECK(ETH_InitStruct->ETH_DeferralCheck));
  assert_param(IS_ETH_RECEIVE_ALL(ETH_InitStruct->ETH_ReceiveAll));
  assert_param(IS_ETH_SOURCE_ADDR_FILTER(ETH_InitStruct->ETH_SourceAddrFilter));
  assert_param(IS_ETH_CONTROL_FRAMES(ETH_InitStruct->ETH_PassControlFrames));
  assert_param(IS_ETH_BROADCAST_FRAMES_RECEPTION(ETH_InitStruct->ETH_BroadcastFramesReception));
  assert_param(IS_ETH_DESTINATION_ADDR_FILTER(ETH_InitStruct->ETH_DestinationAddrFilter));
  assert_param(IS_ETH_PROMISCIOUS_MODE(ETH_InitStruct->ETH_PromiscuousMode));
  assert_param(IS_ETH_MULTICAST_FRAMES_FILTER(ETH_InitStruct->ETH_MulticastFramesFilter));  
  assert_param(IS_ETH_UNICAST_FRAMES_FILTER(ETH_InitStruct->ETH_UnicastFramesFilter));
  assert_param(IS_ETH_PAUSE_TIME(ETH_InitStruct->ETH_PauseTime));
  assert_param(IS_ETH_ZEROQUANTA_PAUSE(ETH_InitStruct->ETH_ZeroQuantaPause));
  assert_param(IS_ETH_PAUSE_LOW_THRESHOLD(ETH_InitStruct->ETH_PauseLowThreshold));
  assert_param(IS_ETH_UNICAST_PAUSE_FRAME_DETECT(ETH_InitStruct->ETH_UnicastPauseFrameDetect));
  assert_param(IS_ETH_RECEIVE_FLOWCONTROL(ETH_InitStruct->ETH_ReceiveFlowControl));
  assert_param(IS_ETH_TRANSMIT_FLOWCONTROL(ETH_InitStruct->ETH_TransmitFlowControl));
  assert_param(IS_ETH_VLAN_TAG_COMPARISON(ETH_InitStruct->ETH_VLANTagComparison));
  assert_param(IS_ETH_VLAN_TAG_IDENTIFIER(ETH_InitStruct->ETH_VLANTagIdentifier));
  /* DMA --------------------------*/
  assert_param(IS_ETH_DROP_TCPIP_CHECKSUM_FRAME(ETH_InitStruct->ETH_DropTCPIPChecksumErrorFrame));
  assert_param(IS_ETH_RECEIVE_STORE_FORWARD(ETH_InitStruct->ETH_ReceiveStoreForward));
  assert_param(IS_ETH_FLUSH_RECEIVE_FRAME(ETH_InitStruct->ETH_FlushReceivedFrame));
  assert_param(IS_ETH_TRANSMIT_STORE_FORWARD(ETH_InitStruct->ETH_TransmitStoreForward));
  assert_param(IS_ETH_TRANSMIT_THRESHOLD_CONTROL(ETH_InitStruct->ETH_TransmitThresholdControl));
  assert_param(IS_ETH_FORWARD_ERROR_FRAMES(ETH_InitStruct->ETH_ForwardErrorFrames));
  assert_param(IS_ETH_FORWARD_UNDERSIZED_GOOD_FRAMES(ETH_InitStruct->ETH_ForwardUndersizedGoodFrames));
  assert_param(IS_ETH_RECEIVE_THRESHOLD_CONTROL(ETH_InitStruct->ETH_ReceiveThresholdControl));
  assert_param(IS_ETH_SECOND_FRAME_OPERATE(ETH_InitStruct->ETH_SecondFrameOperate));
  assert_param(IS_ETH_ADDRESS_ALIGNED_BEATS(ETH_InitStruct->ETH_AddressAlignedBeats));
  assert_param(IS_ETH_FIXED_BURST(ETH_InitStruct->ETH_FixedBurst));
  assert_param(IS_ETH_RXDMA_BURST_LENGTH(ETH_InitStruct->ETH_RxDMABurstLength));
  assert_param(IS_ETH_TXDMA_BURST_LENGTH(ETH_InitStruct->ETH_TxDMABurstLength)); 
  assert_param(IS_ETH_DMA_DESC_SKIP_LENGTH(ETH_InitStruct->ETH_DescriptorSkipLength));  
  assert_param(IS_ETH_DMA_ARBITRATION_ROUNDROBIN_RXTX(ETH_InitStruct->ETH_DMAArbitration));       
  /*-------------------------------- MAC Config ------------------------------*/   
  /*---------------------- ETHERNET MACMIIAR Configuration -------------------*/
  /* Get the ETHERNET MACMIIAR value */
  tmpreg = ETH->MACMIIAR;
  /* Clear CSR Clock Range CR[2:0] bits */
  tmpreg &= MACMIIAR_CR_MASK;
  /* Get hclk frequency value */
  RCC_GetClocksFreq(&rcc_clocks);
  hclk = rcc_clocks.HCLK_Frequency;
  
